---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption
source: html/5b9b34c5-9e7b-1b20-54a9-572a6459a075.htm
---
# Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption

The reference types permitted for a number system to refer to the geometry of a stairs run.

## Syntax (C#)
```csharp
public enum StairsNumberSystemReferenceOption
```